//Задание 5
//
// Напишите функцию, которая принимает два натуральных числа x и n и возвращает x в степени n.
// Иначе говоря, умножает x на себя n раз и возвращает результат.
//
// Используйте Arrow Function синтаксис.
//
// Протестируйте функцию на любых значениях и выведите результат в консоль.

let pow = (x,n) => {
    let result = x;
    if (x < 1 || n < 1) {
        console.log('введите натуральное число')
    } else {
            for (let i = 1; i < n; i++) {
            result *= x
        }
        console.log(result)
    }
}


pow(3,4);


