//Задание 2
//
// Напишите функцию, которая принимает на входе любое число (но не больше 1 000),
// определяет, является ли оно простым, и выводит, простое число или нет. Если введено больше 1 000,
// то выводится сообщение, что данные неверны. Обратите внимание на числа 0 и 1.
//
// Здесь вам пригодятся знания из предыдущего модуля — циклы и условные операторы.

function isPrime(num) {
    let a = 'число простое', b = 'не простое число', c = 'данные неверны', k = Math.sqrt(num);
    if (num > 1000) {
        return c;
    } else if (Number.isInteger(num) && num < 2) {
        return b;
    } else if (num == 2) {
        return a
    } ;
    for (let i = 2; i <= k; i++) {
        if (num % i == 0) {
            return b;
        }
    }
    return a;
}
console.log(isPrime(0));
console.log(isPrime(7));